# -*- coding: utf-8 -*-
"""
Created on Tue Feb 21 20:17:18 2017

@author: caiwd
"""
from . import  config

config = config.params_setup()
class Universal_value():
    def __init__(self):
        self.pic_size = (config.img_size,config.img_size)
        self.class_num = config.label_size
        self.batch_size = config.batch_size
        self.ip_address = config.device_ip
        self.server_port = config.server_port
        self.dial_num_list = config.dial_num_list
        self.camera_nums = len(self.ip_address)
        self.Initialization = config.init
        

        self.list_map = {'0-0': [u'油压,上游过滤器,A侧【2 LHQ650LP】', u'压力', 'bar', 100, 0.1],
                         '0-1': [u'油压,下游过滤器,A侧【2 LHQ651LP】', u'压力', 'bar', 100, 0.1],
                         '0-2': [u'油压,上游过滤器,B侧【2 LHQ652LP】', u'压力', 'bar', 100, 0.1],
                         '0-3': [u'油压,下游过滤器,B侧【2 LHQ653LP】', u'压力', 'bar', 100, 0.1],
                         '0-4': [u'燃油压力上游过滤器【2 LHQ600LP】', u'压力', 'bar', 120, 0.05],
                         '0-5': [u'燃油压力下游过滤器【2 LHQ601LP】', u'压力', 'bar', 120, 0.05],
                         '0-6': [u'混合空气压力A侧【2 LHQ800LP】', u'压力', 'bar', 80, 0.05],
                         '0-7': [u'混合空气压力A侧【2 LHQ801LP】', u'压力', 'bar', 80, 0.05],

                         '1-0': [u'发动机水入口压力【2 LHQ700LP】', u'压力', 'bar', 100, 0.1],
                         '1-1': [u'发动机水入口温度【2 LHQ700LT】', u'温度', '℃', 120, 1],
                         '1-2': [u'发动机油入口温度A侧【2 LHQ650LT】', u'温度', '℃', 120, 1],
                         '1-3': [u'发动机油入口温度B侧【2 LHQ652LT】', u'温度', '℃', 120, 1],
                         '1-4': [u'发动机水入口温度【2 LHQ700LT】', u'温度', '℃', 120, 1],
                         '1-5': [u'混合空气温度A侧【2 LHQ800LT】', u'温度', '℃', 120, 1],
                         '1-6': [u'混合空气温度B侧【2 LHQ801LT】', u'温度', '℃', 120, 1],

                         '2-0': [u'油压,上游过滤器,A侧【2 LHQ150LP】', u'压力', 'bar', 100, 0.1],
                         '2-1': [u'油压,下游过滤器,A侧【2 LHQ151LP】', u'压力', 'bar', 100, 0.1],
                         '2-2': [u'油压,上游过滤器,B侧【2 LHQ152LP】', u'压力', 'bar', 100, 0.1],
                         '2-3': [u'油压,下游过滤器,B侧【2 LHQ153LP】', u'压力', 'bar', 100, 0.1],
                         '2-4': [u'燃油压力上游过滤器【2 LHQ100LP】', u'压力', 'bar', 120, 0.05],
                         '2-5': [u'燃油压力下游过滤器【2 LHQ101LP】', u'压力', 'bar', 120, 0.05],
                         '2-6': [u'混合空气压力A侧【2 LHQ300LP】', u'压力', 'bar', 80, 0.05],
                         '2-7': [u'混合空气压力A侧【2 LHQ301LP】', u'压力', 'bar', 80, 0.05],

                         '3-0': [u'发动机水入口压力【2 LHQ200LP】', u'压力', 'bar', 100, 0.1],
                         '3-1': [u'发动机水入口温度【2 LHQ200LT】', u'温度', '℃', 120, 1],
                         '3-2': [u'发动机油入口温度A侧【2 LHQ150LT】', u'温度', '℃', 120, 1],
                         '3-3': [u'发动机油入口温度B侧【2 LHQ152LT】', u'温度', '℃', 120, 1],
                         '3-4': [u'发动机水入口温度【2 LHQ203LT】', u'温度', '℃', 120, 1],
                         '3-5': [u'混合空气温度A侧【2 LHQ300LT】', u'温度', '℃', 120, 1],
                         '3-6': [u'混合空气温度B侧【2 LHQ301LT】', u'温度', '℃', 120, 1]
                         # '表盘编号'[标题名称，Y坐标名称，单位，量程最大值，比例]
                         }

        # 几项需要保存传输的数据
        self.allParam = {
            'Company' :  "大亚湾核电",
            'Factory' : "二号反应堆",
            'Plant' : "应急柴油机2",
            'Middleware' : "127.0.0.1",
            'Port' : "17003",
            'KeepSecond' : "1",
            'Type' : "0",
            'CHANNID' : " ",
            'Source' : " "
        }

        self.oppositeDic = {
            '0-0' : '0',
            '0-1' : '1',
            '0-2' : '2',
            '0-3' : '3',
            '0-4' : '4',
            '0-5' : '5',
            '0-6' : '6',
            '0-7' : '7',
            '1-0' : '8',
            '1-1' : '9',
            '1-2' : '10',
            '1-3' : '11',
            '1-4' : '12',
            '1-5' : '13',
            '1-6' : '14',
            '1-7' : '15',
            '2-0' : '16',
            '2-1' : '17',
            '2-2' : '18',
            '2-3' : '19',
            '2-4' : '20',
            '2-5' : '21',
            '2-6' : '22',
            '3-0' : '23',
            '3-1' : '24',
            '3-2' : '25',
            '3-3' : '26',
            '3-4' : '27',
            '3-5' : '28',
            '3-6' : '29'
        }
